#include "NDDEMO/dm/DMainSystem.h"
#include "NDDEMO/du/DUMacro.h"
#include "dolphin/GX.h"
#include "dolphin/OS.h"
#include <string.h>

static OSStopwatch SwMsec;
static float MSecGX;
static float iMSecGX;
static float MSecCPU;
static u32 triCnt;
static u32 verCnt;

struct iBGTHREAD{
	OSThread SMThread; //0x0
	u8 SMThreadStack[4096]; //0x310
	u8 request_flag[128]; //0x1310
	u16 request_file_number[128]; //0x1390
	s8 request_stage_no[128]; //0x1490
	s8 request_model_no[128]; //0x1510
	s16 read_p; //0x1590
	s16 write_p; //0x1592
	struct{
		s8 wait_count; //0x0
		s16 wait_table[128]; //0x2
	} stage[8]; //0x1594
	u8 delete_flag[9]; //0x1da4
};

iBGTHREAD bgThread;

//unused
GXRenderModeObj irmode;

static GXRenderModeObj irmodeobj;

//unused
static void* iDemoFrameBuffer1;
static void* iDemoFrameBuffer2;
static void* iDemoCurrentBuffer;
static void* iDefaultFifo;
static GXFifoObj* iDefaultFifoObj;
static s8 FirstFrame;

u8 bg_stimer;

//unused
static u16 token_id;
static u16 old_token_id;
static u16 token_timer;

static const char* iFileNameData[34] = {
	"ARROW.NDM",
	"STG_ENTR.NDM",
	"STG_ENTR.BGH",
	"STG_ENTR.MCD",
	"STG_HANG.NDM",
	"STG_HANG.BGH",
	"STG_HANG.MCD",
	"BIPLANE.NDM",
	"STG_DOME.NDM",
	"STG_DOME.BGH",
	"STG_DOME.MCD",
	"STG_CAVE.NDM",
	"STG_CAVE.BGH",
	"STG_CAVE.MCD",
	"KURIBO.NDM",
	"STG_CINE.NDM",
	"STG_CINE.BGH",
	"STG_CINE.MCD",
	"MARIO00",
	"T_STAR",
	"T_HART",
	"STG_SPIL.NDM",
	"STG_SPIL.BGH",
	"STG_SPIL.MCD",
	"STG_ENVE.NDM",
	"STG_ENVE.BGH",
	"STG_ENVE.MCD",
	"STG_MPOL.NDM",
	"STG_MPOL.BGH",
	"STG_MPOL.MCD",
	"MPOL_CAM.MCD",
	"COIN.NDM",
	"STG_OPEN.NDM",
	"STG_OPEN.MCD"
};

static const char* songFilenameTable[9] = {
	"audio/gcdemo.sng",
	"audio/entrance.sng",
	"audio/dome.sng",
	"audio/spiral.sng",
	"audio/hangar.sng",
	"audio/cave.sng",
	"audio/cinema.sng",
	"audio/metal.sng",
	"audio/coins.sng"
};

static s8 iCourseData[11] = {
	0,
	2,
	5,
	1,
	3,
	0,
	4,
	6,
	7,
	0,
	0xFF
};

typedef struct _StructPerf{
	u8 type; //0x0
	char text[11];
} StructPerf;

StructPerf stPerf0[23] = {
	{11, "TRIANGLES"},
	{0, "VERTICES "},
	{1, "CLIP_VTX "},
	{2, "CLIP_CLK "},
	{3, "XF_WAITIN"},
	{4, "XFWAITOUT"},
	{5, "XF_XFRM  "},
	{6, "XF_LIT   "},
	{7, "XF_BOT   "},
	{8, "XF_REGLD "},
	{9, "XF_REGRD "},
	{10, "CLIPRATIO"},
	{12, "TRI_CULL "},
	{13, "TRI_PASS "},
	{14, "TRI_SCISS"},
	{27, "QUAD_0CVG"},
	{28, "QUADNOCVG"},
	{29, "QUAD_1CVG"},
	{30, "QUAD_2CVG"},
	{31, "QUAD_3CVG"},
	{32, "QUAD_4CVG"},
	{33, "AVG_QUAD "},
	{35, ""}
};

StructPerf stPerf1[22] = {
	{16, "VERTICES "},
	{0, "TEXELS   "},
	{1, "TX_IDLE  "},
	{2, "TX_REGS  "},
	{3, "TX_MEMSTL"},
	{4, "TCCHECK12"},
	{5, "TCCHECK34"},
	{6, "TCCHECK56"},
	{7, "TCCHECK78"},
	{8, "TC_MISS  "},
	{9, "VC_ELEMQ "},
	{10, "VC_MISSQ "},
	{11, "VC_MEMREQ"},
	{12, "VC_STAT7 "},
	{13, "VCMISSREP"},
	{14, "VCSTRMLOW"},
	{15, "VCALLSTAT"},
	{17, "FIFO_REQ "},
	{18, "CALL_REQ "},
	{19, "VC_MISSRQ"},
	{20, "CP_ALLREQ"},
	{22, ""}
};

